#include <iostream>


// Указатель - это переменная, созданная для хранения в себе адреса какой-либо области памяти.
// Например, указатель может хранить адрес созданной ранее в программе переменной.




int main() {
	setlocale(LC_ALL, "Russian");
	int n;

	n = 10;
	std::cout << "n = " << n << "\n"; // вывод значения переменной
	std::cout << "&n = " << &n << "\n"; // вывод адреса переменной
	int* pn = &n; // создание указателя, напрпавленного на переменную n
	std::cout << "pn = " << pn << "\n";
	// Разыменование указателя - операция, применяемая только к указателям и позволяющая обратиться к объекту, на который направлен указатель.
	std::cout << "*pn = " << *pn << "\n";

	*pn = 15;
	std::cout << "Новая n = " << n << "\n";











	return 0;
}